#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=0bc62e5eb52cc7300d3725c6978aeff8b684bd65]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=311255630624150942]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=8215203548822549650]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be created
  + resource "google_cloud_run_service" "batch_events_bq_writer" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "northamerica-northeast1"
      + name                       = "batch_events_bq_writer"
      + project                    = "off-net-dev"
      + status                     = (known after apply)

      + metadata {
          + annotations           = {
              + "autoscaling.knative.dev/minScale" = "1"
              + "client.knative.dev/user-image"    = "gcr.io/off-net-dev/events_bq_writer:0bc62e5eb52cc7300d3725c6978aeff8b684bd65"
              + "run.googleapis.com/ingress"       = "all"
            }
          + effective_annotations = {
              + "autoscaling.knative.dev/minScale" = "1"
              + "client.knative.dev/user-image"    = "gcr.io/off-net-dev/events_bq_writer:0bc62e5eb52cc7300d3725c6978aeff8b684bd65"
              + "run.googleapis.com/ingress"       = "all"
            }
          + effective_labels      = (known after apply)
          + generation            = 0
          + namespace             = (known after apply)
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = (known after apply)
          + uid                   = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "client.knative.dev/user-image"  = "gcr.io/off-net-dev/events_bq_writer:0bc62e5eb52cc7300d3725c6978aeff8b684bd65"
                  + "run.googleapis.com/client-name" = "cloud-console"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "serviceAccount:dora-wif@off-net-dev.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/off-net-dev/events_bq_writer:0bc62e5eb52cc7300d3725c6978aeff8b684bd65"
                  + name  = (known after apply)

                  + env {
                      + name  = "PROJECT_NAME"
                      + value = "off-net-dev"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.fourkeys.google_eventarc_trigger.primary will be created
  + resource "google_eventarc_trigger" "primary" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + event_data_content_type = (known after apply)
      + id                      = (known after apply)
      + location                = "northamerica-northeast1"
      + name                    = "name"
      + project                 = "off-net-dev"
      + terraform_labels        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)

      + destination {
          + cloud_run_service {
              + region  = "northamerica-northeast1"
              + service = "batch_events_bq_writer"
            }
        }

      + matching_criteria {
          + attribute = "bucket"
          + value     = "off-net-dev-events-archieve-local"
        }
      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.storage.object.v1.finalized"
        }
    }

  # module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0] is tainted, so must be replaced
-/+ resource "null_resource" "run_command" {
      ~ id       = "311255630624150942" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*